apache/nuttx/arch/mips/src/pic32mz/pic32mz-dma.c
/****************************************************************************
 * arch/mips/src/pic32mz/chip/pic32mz-dma.c
 *
 *   Copyright (C) 2019 Abdelatif Guettouche. All rights reserved.
 *   Author: Abdelatif Guettouche <abdelatif.guettouche@gmail.com>
 *
 * This file is a part of NuttX:
 *
 *   Copyright (C) 2019 Gregory Nutt. All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>
#include <debug.h>
#include <errno.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>

#include "up_arch.h"
#include "up_internal.h"
#include "sched/sched.h"

#include "hardware/pic32mz-dma.h"
#include "pic32mz-dma.h"

#ifdef CONFIG_PIC32MZ_DMA

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Convert a virtual address to a physical address */

#define PHYS_ADDR(va) ((uint32_t)(va) & 0x1fffffff)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure describes one DMA channel */

struct pic32mz_dmach_s
{
  uint8_t        chan;            /* DMA channel number (0-8) */
  uint8_t        irq;             /* DMA channel IRQ number */
  uint32_t       base;            /* DMA register channel base address */
  bool           inuse;           /* true: The DMA channel is in use */
  dma_callback_t callback;        /* Callback invoked when the DMA completes */
  void          *arg;             /* Argument passed to callback function */
  struct pic32mz_dma_chcfg_s cfg; /* Channel's config */
};

/* This structure describes the state of the DMA controller */

struct pic32mz_dmac_s
{
  /* Protects the channels' table */

  sem_t chsem;

  /* Describes all DMA channels */

  struct pic32mz_dmach_s dmachs[CHIP_NDMACH];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static void pic32mz_dma_takesem(struct pic32mz_dmac_s *dmac);
static inline void pic32mz_dma_givesem(struct pic32mz_dmac_s *dmac);

static inline uint32_t pic32mz_dma_getreg(FAR struct pic32mz_dmach_s *dmach,
                                          uint8_t offset);
static inline void pic32mz_dma_putreg(FAR struct pic32mz_dmach_s *dmach,
                                      uint8_t offset, uint32_t value);
static inline void pic32mz_dma_modifyreg(FAR struct pic32mz_dmach_s *dmach,
                                         uint8_t offset,
                                         uint32_t clrbits, uint32_t setbits);
static inline uint32_t pic32mz_dma_getglobal(uint8_t offset);
static inline void pic32mz_dma_putglobal(uint8_t offset, uint32_t value);

static inline void pic32mz_dma_enable(FAR struct pic32mz_dmach_s *dmach);
static inline void pic32mz_dma_disable(FAR struct pic32mz_dmach_s *dmach);
static inline void pic32mz_dma_priority(FAR struct pic32mz_dmach_s *dmach,
                                        uint8_t priority);
static inline void pic32mz_dma_srcaddr(FAR struct pic32mz_dmach_s *dmach,
                                       uint32_t addr);
static inline void pic32mz_dma_destaddr(FAR struct pic32mz_dmach_s *dmach,
                                        uint32_t addr);
static inline void pic32mz_dma_srcsize(FAR struct pic32mz_dmach_s *dmach,
                                       uint16_t size);
static inline void pic32mz_dma_destsize(FAR struct pic32mz_dmach_s *dmach,
                                        uint16_t size);
static inline void pic32mz_dma_cellsize(FAR struct pic32mz_dmach_s *dmach,
                                        uint16_t size);
static inline void pic32mz_dma_startirq(FAR struct pic32mz_dmach_s *dmach,
                                        int irq);
static inline void pic32mz_dma_forcestart(FAR struct pic32mz_dmach_s *dmach);
static inline void pic32mz_dma_abortirq(FAR struct pic32mz_dmach_s *dmach,
                                        int irq);
static inline void pic32mz_dma_forceabort(FAR struct pic32mz_dmach_s *dmach);

static inline void pic32mz_dma_intctrl(FAR struct pic32mz_dmach_s *dmach,
                                       uint8_t cfg);
static inline void pic32mz_dma_intclr(FAR struct pic32mz_dmach_s *dmach);
static int pic32mz_dma_interrupt(int irq, void *context, FAR void *arg);

static void pic32mz_dma_mode(FAR struct pic32mz_dmach_s *dmach,
                             uint8_t mode);
static void pic32mz_dma_config(FAR struct pic32mz_dmach_s *dmach,
                               FAR const struct pic32mz_dma_chcfg_s *cfg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

