apache/nuttx/arch/mips/src/pic32mz/pic32mz-dma.c
/* This array describes the state of each DMA */

static struct pic32mz_dmac_s g_dmac =
{
  .dmachs =
    {
      {
        .chan = 0,
        .irq  = PIC32MZ_IRQ_DMA0,
        .base = PIC32MZ_DMACH0_K1BASE,
      },
      {
        .chan = 1,
        .irq  = PIC32MZ_IRQ_DMA1,
        .base = PIC32MZ_DMACH1_K1BASE,
      },
      {
        .chan = 2,
        .irq  = PIC32MZ_IRQ_DMA2,
        .base = PIC32MZ_DMACH2_K1BASE,
      },
      {
        .chan = 3,
        .irq  = PIC32MZ_IRQ_DMA3,
        .base = PIC32MZ_DMACH3_K1BASE,
      },
      {
        .chan = 4,
        .irq  = PIC32MZ_IRQ_DMA4,
        .base = PIC32MZ_DMACH4_K1BASE,
      },
      {
        .chan = 5,
        .irq  = PIC32MZ_IRQ_DMA5,
        .base = PIC32MZ_DMACH5_K1BASE,
      },
      {
        .chan = 6,
        .irq  = PIC32MZ_IRQ_DMA6,
        .base = PIC32MZ_DMACH6_K1BASE,
      },
      {
        .chan = 7,
        .irq  = PIC32MZ_IRQ_DMA7,
        .base = PIC32MZ_DMACH7_K1BASE,
      },
    }
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: pic32mz_dma_takesem
 *
 * Description:
 *   Take the exclusive access, waiting as necessary
 *
 ****************************************************************************/

static void pic32mz_dma_takesem(struct pic32mz_dmac_s *dmac)
{
  int ret;

  do
    {
      /* Take the semaphore (perhaps waiting) */

      ret = nxsem_wait(&dmac->chsem);

      /* The only case that an error should occur here is if the wait was
       * awakened by a signal.
       */

      DEBUGASSERT(ret == OK || ret == -EINTR);
    }
  while (ret == -EINTR);
}

/****************************************************************************
 * Name: pic32mz_dma_givesem
 *
 * Description:
 *   Release the semaphore
 *
 ****************************************************************************/

static inline void pic32mz_dma_givesem(struct pic32mz_dmac_s *dmac)
{
  (void)nxsem_post(&dmac->chsem);
}

/****************************************************************************
 * Name: pic32mz_dma_getreg
 *
 * Description:
 *   Get a 32-bit register value by offset
 *
 ****************************************************************************/

static inline uint32_t pic32mz_dma_getreg(FAR struct pic32mz_dmach_s *dmach,
                                          uint8_t offset)
{
  return getreg32(dmach->base + offset);
}

/****************************************************************************
 * Name: pic32mz_dma_putreg
 *
 * Description:
 *   Put a 32-bit register value by offset
 *
 ****************************************************************************/

static inline void pic32mz_dma_putreg(FAR struct pic32mz_dmach_s *dmach,
                                      uint8_t offset, uint32_t value)
{
  putreg32(value, dmach->base + offset);
}

/****************************************************************************
 * Name: pic32mz_dma_modifyreg
 *
 * Description:
 *   Modify a 32-bit register value by offset
 *
 ****************************************************************************/

static inline void pic32mz_dma_modifyreg(FAR struct pic32mz_dmach_s *dmach,
                                         uint8_t offset,
                                         uint32_t clrbits, uint32_t setbits)
{
  modifyreg32(dmach->base + offset, clrbits, setbits);
}

/****************************************************************************
 * Name: pic32mz_dma_getglobal
 *
 * Description:
 *   Get a 32-bit global register value by offset
 *
 ****************************************************************************/

static inline uint32_t pic32mz_dma_getglobal(uint8_t offset)
{
  return getreg32(PIC32MZ_DMA_K1BASE + offset);
}

/****************************************************************************
 * Name: pic32mz_dma_putglobal
 *
 * Description:
 *   Put a 32-bit global register value by offset
 *
 ****************************************************************************/

static inline void pic32mz_dma_putglobal(uint8_t offset, uint32_t value)
{
  putreg32(value, PIC32MZ_DMA_K1BASE + offset);
}

/****************************************************************************
 * Name: pic32mz_dma_enable
 *
 * Description:
 *  Enable the DMA channel.
 *
 ****************************************************************************/

static inline void pic32mz_dma_enable(FAR struct pic32mz_dmach_s *dmach)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMA_CONSET_OFFSET, DMACH_CON_CHEN);
}

/****************************************************************************
 * Name: pic32mz_dma_disable
 *
 * Description:
 *  Disable the DMA channel.
 *
 ****************************************************************************/

static inline void pic32mz_dma_disable(FAR struct pic32mz_dmach_s *dmach)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMA_CONCLR_OFFSET, DMACH_CON_CHEN);
}

/****************************************************************************
 * Name: pic32mz_dma_priority
 *
 * Description:
 *   Set the channel's priority.
 *
 ****************************************************************************/

static inline void pic32mz_dma_priority(FAR struct pic32mz_dmach_s *dmach,
                                        uint8_t priority)
{
  /* Highest priority is 3. */

  if (priority <= 3)
    {
      pic32mz_dma_modifyreg(dmach, PIC32MZ_DMA_CON_OFFSET,
                            DMACH_CON_CHPRI_MASK,
                            priority << DMACH_CON_CHPRI_SHIFT);
    }
}

/****************************************************************************
 * Name: pic32mz_dma_srcaddr
 *
 * Description:
 *   Set the channel's source address.
 *
 ****************************************************************************/

static inline void pic32mz_dma_srcaddr(FAR struct pic32mz_dmach_s *dmach,
                                       uint32_t addr)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_SSA_OFFSET, PHYS_ADDR(addr));
}

/****************************************************************************
 * Name: pic32mz_dma_destaddr
 *
 * Description:
 *   Set the channel's destination address.
 *
 ****************************************************************************/

static inline void pic32mz_dma_destaddr(FAR struct pic32mz_dmach_s *dmach,
                                        uint32_t addr)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_DSA_OFFSET, PHYS_ADDR(addr));
}

/****************************************************************************
 * Name: pic32mz_dma_srcsize
 *
 * Description:
 *   Set the channel's source size.
 *
 ****************************************************************************/

