apache/nuttx/arch/mips/src/pic32mz/pic32mz-dma.c
static inline void pic32mz_dma_srcsize(FAR struct pic32mz_dmach_s *dmach,
                                       uint16_t size)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_SSIZ_OFFSET, size);
}

/****************************************************************************
 * Name: pic32mz_dma_destsize
 *
 * Description:
 *   Set the channel's destination size.
 *
 ****************************************************************************/

static inline void pic32mz_dma_destsize(FAR struct pic32mz_dmach_s *dmach,
                                        uint16_t size)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_DSIZ_OFFSET, size);
}

/****************************************************************************
 * Name: pic32mz_dma_cellsize
 *
 * Description:
 *   Set the channel's cell size.
 *
 ****************************************************************************/

static inline void pic32mz_dma_cellsize(FAR struct pic32mz_dmach_s *dmach,
                                        uint16_t size)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_CSIZ_OFFSET, size);
}

/****************************************************************************
 * Name: pic32mz_dma_startirq
 *
 * Description:
 *   Set the channel's start irq.
 *
 ****************************************************************************/

static inline void pic32mz_dma_startirq(FAR struct pic32mz_dmach_s *dmach,
                                        int irq)
{
  /* Enable start irq matching. */

  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_ECONSET_OFFSET, DMACH_ECON_SIRQEN);

  /* Clear the field before setting it. */

  pic32mz_dma_modifyreg(dmach, PIC32MZ_DMACH_ECON_OFFSET,
                        DMACH_ECON_CHSIRQ_MASK,
                        irq << DMACH_ECON_CHSIRQ_SHIFT);
}

/****************************************************************************
 * Name: pic32mz_dma_forcestart
 *
 * Description:
 *   Initiate the transfer by software.
 *
 ****************************************************************************/

static inline void pic32mz_dma_forcestart(FAR struct pic32mz_dmach_s *dmach)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_ECONSET_OFFSET, DMACH_ECON_CFORCE);
}

/****************************************************************************
 * Name: pic32mz_dma_abortirq
 *
 * Description:
 *   Set the channel's abort irq.
 *
 ****************************************************************************/

static inline void pic32mz_dma_abortirq(FAR struct pic32mz_dmach_s *dmach,
                                        int irq)
{
  /* Enable abort irq matching. */

  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_ECONSET_OFFSET, DMACH_ECON_AIRQEN);

  /* Clear the field before setting it. */

  pic32mz_dma_modifyreg(dmach, PIC32MZ_DMACH_ECON_OFFSET,
                        DMACH_ECON_CHAIRQ_MASK,
                        irq << DMACH_ECON_CHAIRQ_SHIFT);
}

/****************************************************************************
 * Name: pic32mz_dma_forceabort
 *
 * Description:
 *   Initiate the transfer by software.
 *
 ****************************************************************************/

static inline void pic32mz_dma_forceabort(FAR struct pic32mz_dmach_s *dmach)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_ECONSET_OFFSET, DMACH_ECON_CABORT);
}

/****************************************************************************
 * Name: pic32mz_dma_intclr
 *
 * Description:
 *  Clears the channel's interrupt flags.
 *
 ****************************************************************************/

static inline void pic32mz_dma_intclr(FAR struct pic32mz_dmach_s *dmach)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_INTCLR_OFFSET,
                     DMACH_INT_FLAGS_MASK);
}

/****************************************************************************
 * Name: pic32mz_dma_intctrl
 *
 * Description:
 *  Enables the different interrupt's flags.
 *
 ****************************************************************************/

static inline void pic32mz_dma_intctrl(FAR struct pic32mz_dmach_s *dmach,
                                       uint8_t cfg)
{
  /* Clear all interrupts flags */

  pic32mz_dma_intclr(dmach);

  /* Disable previous interrupts */

  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_INTCLR_OFFSET,
                     DMACH_INT_EN_MASK);

  /* Enable the interrupts requested. */

  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_INTSET_OFFSET,
                     cfg << DMACH_INT_EN_SHIFT);
}

/****************************************************************************
 * Name: pic32mz_dma_interrupt
 *
 * Description:
 *  DMA interrupt handler.
 *
 ****************************************************************************/

static int pic32mz_dma_interrupt(int irq, void *context, FAR void *arg)
{
  struct pic32mz_dmach_s *dmach;
  uint8_t status;
  int chndx = 0;

  /* Get the channel structure from the irq. */

  chndx = irq - PIC32MZ_IRQ_DMA0;
  dmach = &g_dmac.dmachs[chndx];

  /* Get the interrupt status. */

  status = (uint8_t)(pic32mz_dma_getreg(dmach, PIC32MZ_DMACH_INT_OFFSET) &
                     DMACH_INT_FLAGS_MASK);

  /* Clear the interrupt flags. */

  up_clrpend_irq(dmach->irq);
  pic32mz_dma_intclr(dmach);

  /* Invoke the callback. */

  if (dmach->callback)
    {
      dmach->callback(dmach, status, dmach->arg);
    }

  return OK;
}

/****************************************************************************
 * Name: pic32mz_dma_mode
 *
 * Description:
 *   Set the channel's mode
 *
 ****************************************************************************/

static void pic32mz_dma_mode(FAR struct pic32mz_dmach_s *dmach,
                             uint8_t mode)
{
  if (mode & PIC32MZ_DMA_MODE_BASIC)
    {
      /* Basic mode doesn't need any config */
    }

  if (mode & PIC32MZ_DMA_MODE_AUTOEN)
    {
      pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_CONSET_OFFSET, DMACH_CON_CHAEN);
    }
}

/****************************************************************************
 * Name: pic32mz_dma_config
 *
 * Description:
 *   Config the DMA channel
 *
 ****************************************************************************/

